<?php

/*
| -------------------------------------------------------------------
| Foreign Characters table for transliteration ( TR - Turkish )
| -------------------------------------------------------------------
| This file contains an array of foreign characters for transliteration
| conversion used by the Utf8 Class.
|
*/
$transliteration['general'] = array(
	'/ä|æ|ǽ/' => 'ae',
	'/ö|œ/'   => 'oe',
	'/ü/'     => 'ü',
	'/Ä/'     => 'Ae',
	'/Ü/'     => 'Ü',
	'/Ö/'     => 'Ö',
	'/À|Á|Â|Ã|Ä|Å|Ǻ|Ā|Ă|Ą|Ǎ/' => 'A',
	'/à|á|â|ã|å|ǻ|ā|ă|ą|ǎ|ª/' => 'a',
	'/Б|б/' => 'b',
	'/Ç|Ć|Ĉ|Ċ|Č/' => 'C',
	'/ç|ć|ĉ|ċ|č/' => 'c',
	'/Ð|Ď|Đ/' => 'D',
	'/ð|ď|đ/' => 'd',
	'/È|É|Ê|Ë|Ē|Ĕ|Ė|Ę|Ě/' => 'E',
	'/è|é|ê|ë|ē|ĕ|ė|ę|ě/' => 'e',
	'/Ĝ|Ğ|Ġ|Ģ/' => 'G',
	'/ĝ|ğ|ġ|ģ/' => 'g',
	'/Ĥ|Ħ/' => 'H',
	'/ĥ|ħ/' => 'h',
	'/Ì|Í|Î|Ï|Ĩ|Ī|Ĭ|Ǐ|Į|İ/' => 'I',
	'/ì|í|î|ï|ĩ|ī|ĭ|ǐ|į|ı/' => 'i',
	'/Ĵ/' => 'J',
	'/ĵ/' => 'j',
	'/Ķ/' => 'K',
	'/ķ/' => 'k',
	'/Ĺ|Ļ|Ľ|Ŀ|Ł/' => 'L',
	'/ĺ|ļ|ľ|ŀ|ł/' => 'l',
	'/Ñ|Ń|Ņ|Ň/'   => 'N',
	'/ñ|ń|ņ|ň|ŉ/' => 'n',
	'/Ò|Ó|Ô|Õ|Ō|Ŏ|Ǒ|Ő|Ơ|Ø|Ǿ/'   => 'O',
	'/ö|ò|ó|ô|õ|ō|ŏ|ǒ|ő|ơ|ø|ǿ|º/' => 'ö',
	'/Ŕ|Ŗ|Ř/' => 'R',
	'/ŕ|ŗ|ř/' => 'r',
	'/Ś|Ŝ|Ş|Š/'   => 'S',
	'/ś|ŝ|ş|š|ſ/' => 'ş',
	'/Ţ|Ť|Ŧ/' => 'T',
	'/ţ|ť|ŧ/' => 't',
	'/Ù|Ú|Û|Ũ|Ū|Ŭ|Ů|Ű|Ų|Ư|Ǔ|Ǖ|Ǘ|Ǚ|Ǜ/' => 'U',
	'/ü|ù|ú|û|ũ|ū|ŭ|ů|ű|ų|ư|ǔ|ǖ|ǘ|ǚ|ǜ/' => 'u',
	'/Ý|Ÿ|Ŷ/' => 'Y',
	'/ý|ÿ|ŷ/' => 'y',
	'/Ŵ|Ẁ|Ẅ|/' => 'W',
	'/ŵ|ẁ|ẅ/'  => 'w',
	'/Ź|Ż|Ž/' => 'Z',
	'/ź|ż|ž/' => 'z',
	'/Æ|Ǽ/'   => 'AE',
	'/ß/'     => 'ss',
	'/Ĳ/'     => 'IJ',
	'/ĳ/'     => 'ij',
	'/Œ/'     => 'OE',
	'/ƒ/'     => 'f',
	
	'/ф/'   => 'f',
	'/ж|Ж/' => 'zh',
	'/щ|Щ/' => 'sch',
	'/З|з/' => 'z',
	'/ю|Ю/' => 'ju',
	'/я|Я/' => 'ja',
	'/Ч/'   => 'ch',
	'/Д/'   => 'd',
	'/Л/'   => 'l',
	'/П/'   => 'p',
	'/ъ|Ъ/' => 'b',
	'/ы|Ы/' => 'y',
	'/ш|Ш/' => 'sh',
	'/и|И/' => 'i',
	'/й|Й/' => 'j',
);

/* End of file transliteration.php */
/* Location: ./app/config/i18n/tr_TR/transliteration.php */